---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document Properties
Document Class See Also Send Feedback
---

The Document type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

Document Class

Autodesk.Revit.Creation Namespace